<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
	<head>
		<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
		<title>Cafeteria Tripé</title>
		<style>
			#content {
				width: 600px;
				height: auto;
				margin: 0 auto;
			}
			
			#content h1 {
				text-align: center;			
			}
			
			#content p {
				text-align: justify;			
			}
			
			#good-luck {
				text-align: center;			
				text-decoration: underline;
				font-style: italic;
			}
		</style>
	</head>
	<body>
		<div id="content">
			<h1>Descri&ccedil;&atilde;o do Problema</h1>
			<hr />
			<p>Tr&ecirc;s amigos, fan&aacute;ticos por caf&eacute;, fizeram um trato para o primeiro semestre de 2013: toda sexta feira, 
			eles visitariam uma cafeteria diferente na cidade do Rio de Janeiro. E como trato &eacute; trato, eles o cumpriram.</p>
			
			<p>Depois de visitarem cafeterias pelas 25 sextas feiras do primeiro semestre, se apaixonaram ainda mais pelo assunto e 
			resolveram abrir a pr&oacute;pria cafeteria deles. Depois de investir no espa&ccedil;o, maquin&aacute;rio e mat&eacute;ria 
			prima, eles resolveram investir em um sistema para o estabelecimento.</p>
			
			<p>Chegaram at&eacute; eles que n&oacute;s, a Cowabunga Softwares S.A., somos o grupo mais indicado para pegar este servi&ccedil;o. 
			E para nos testar, o Trip&eacute; (como se entitulam os tr&ecirc;s amigos) nos pediu apenas uma funcionalidade nessa primeira 
			vers&atilde;o do sistema.</p>
			
			<p>Eles querem uma &uacute;nica p&aacute;gina: uma listagem com todos os tipos de caf&eacute;s que o estabelecimento vender&aacute;.
			Na listagem dever&aacute; aparecer um identificador para o pedido (caso o cliente queira pedir pelo n&uacute;mero), o nome do caf&eacute;,
			uma breve descri&ccedil;&atilde;o (de at&eacute; 60 caracteres) e o pre&ccedil;o unit&aacute;rio em reais.</p>
			
			<p>Esta p&aacute; dever&aacute; ter tamb&eacute;m um pequeno formul&aacute;rio para que o operador possa incluir novos tipos de caf&eacute;</p>
			
			<p>Um dos tr&ecirc;s clientes tamb&eacute;m &eacute; desenvolvedor e não vai nos ver com bons olhos se fizermos um projeto sem uma 
			boa cobertura de testes unit&aacute;rios, de integra&ccedil;&atilde;o e de sistema. Sendo assim, <strong>TESTES S&Atilde;O PRIMORDIAIS</strong> para 
			a conquista do cliente. Isso sem nem falar nas facilidades que esta boa estrutura de testes trar&aacute; para a manuten&ccedil;&atilde;o do projeto</p>
			
			<p>O design das p&aacute;ginas do projeto não ficará por nossa conta. Uma empresa terceira deverá enviá-lo numa segunda fase e nós adaptaremos o 
			sistema para seguir o layout enviado por eles.</p>
			
			<h2 id="good-luck">Bom trabalho!</h2>
		</div>
	</body>
</html>